// BSLLS:UnusedLocalMethod-off
#Использовать asserts
#Использовать ".."

&ПараметризованныйТест(Имя = "Тест с параметрами {Параметры}")
&ИсточникЗначение("1.1.1", "1.1.1")
&ИсточникЗначение("1", "1.0.0")
&ИсточникЗначение("2.0", "2.0.0")
Процедура РелизнаяВерсияВСтроку(ВерсияСтрокой, Ожидание) Экспорт
	Версия = Новый Версия(ВерсияСтрокой);
	Ожидаем.Что(Версия.ВСтроку()).Равно(Ожидание);
КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("1.1.1-alpha", "1.1.1-alpha")
&ИсточникЗначение("1.1.1-alpha.1.2", "1.1.1-alpha.1.2")
&ИсточникЗначение("1.1.1-beta.1+abcdef.456", "1.1.1-beta.1+abcdef.456")
Процедура ПреРелизнаяВерсияВСтроку(ВерсияСтрокой, Ожидание) Экспорт
	Версия = Новый Версия(ВерсияСтрокой);
	Ожидаем.Что(Версия.ВСтроку()).Равно(Ожидание);
КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение(".1.1", "Основная версия <.> должна содержать только цифры")
&ИсточникЗначение("1..1", "Второстепенная версия <.> должна содержать только цифры")
&ИсточникЗначение("1.2.-", "Версия патча <-> должна содержать только цифры")
&ИсточникЗначение("1.2.", "Неожиданный конец строки версии, нет данных после разделителя <.>")
&ИсточникЗначение("aa1.2.3", "Основная версия <aa1> должна содержать только цифры")
&ИсточникЗначение("1.1aa.1", "Второстепенная версия <1aa> должна содержать только цифры")
&ИсточникЗначение("1.2.1aa", "Версия патча <1aa> должна содержать только цифры")
&ИсточникЗначение("1.2.1.3", "Ожидается разделитель пререлизной версии <-> или метаданных сборки <+>, получен <.>")
&ИсточникЗначение("1.2.1-", "Ожидается компонент версии, но получен <EOF>")
&ИсточникЗначение("1.2.1+", "Ожидается компонент версии, но получен <EOF>")
&ИсточникЗначение("1.2.1-beta+", "Ожидается компонент версии, но получен <EOF>")
&ИсточникЗначение("1.2.1-beta..1", "Ожидается компонент версии, но получен <.>")
Процедура ПроверитьОшибкиРазбора(ВерсияСтрокой, Ожидание) Экспорт
	Версия = Новый Версия(ВерсияСтрокой);
	Ожидаем.Что(Версия.ОшибкаЧтенияВерсии).Равно(Ожидание);
КонецПроцедуры
